ugo1983/nucleo-f429zi-freertos-tcp-echo-server/FreeRTOS-Plus/Demo/FreeRTOS_Plus_TCP_and_FAT_STM32F4xxx/src/main.c
	static void prvCreateExampleFiles( void )
	{
	extern void vCreateAndVerifyExampleFiles( char *pcMountPath );
	extern void vStdioWithCWDTest( const char *pcMountPath );
	extern void vMultiTaskStdioWithCWDTest( const char *const pcMountPath, uint16_t usStackSizeWords );

		FreeRTOS_printf( ( "Mount SD-card\n" ) );

		if( pxDisk != NULL )
		{
			/* Remove the base directory again, ready for another boot. */
			ff_deltree( mainSD_CARD_TESTING_DIRECTORY );

			/* Make sure that the testing directory exists. */
			ff_mkdir( mainSD_CARD_TESTING_DIRECTORY );

			/* Create a few example files on the disk.  These are not deleted again. */
			vCreateAndVerifyExampleFiles( mainSD_CARD_TESTING_DIRECTORY );
		}
	}

#endif /* ( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) ) */
/*-----------------------------------------------------------*/

#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )

	static void prvServerWorkTask( void *pvParameters )
	{
	TCPServer_t *pxTCPServer = NULL;
	const TickType_t xInitialBlockTime = pdMS_TO_TICKS( 5000UL );
	const TickType_t xSDCardInsertDelay = pdMS_TO_TICKS( 1000UL );

	/* A structure that defines the servers to be created.  Which servers are
	included in the structure depends on the mainCREATE_HTTP_SERVER and
	mainCREATE_FTP_SERVER settings at the top of this file. */
	static const struct xSERVER_CONFIG xServerConfiguration[] =
	{
		#if( mainCREATE_HTTP_SERVER == 1 )
				/* Server type,		port number,	backlog, 	root dir. */
				{ eSERVER_HTTP, 	80, 			12, 		configHTTP_ROOT },
		#endif

		#if( mainCREATE_FTP_SERVER == 1 )
				/* Server type,		port number,	backlog, 	root dir. */
				{ eSERVER_FTP,  	21, 			12, 		"" }
		#endif
	};


		/* Remove compiler warning about unused parameter. */
		( void ) pvParameters;

		/* Can't serve web pages or start an FTP session until the card is
		inserted.  The Xplained Pro hardware cannot generate an interrupt when
		the card is inserted - so periodically look for the card until it is
		inserted. */
		while( ( pxDisk = FF_SDDiskInit( mainSD_CARD_DISK_NAME ) ) == NULL )
		{
			vTaskDelay( xSDCardInsertDelay );
		}

		FreeRTOS_printf( ( "SD card detected, creating example files." ) );
		prvCreateExampleFiles();
		FreeRTOS_printf( ( "Example files created." ) );

		/* A disk is going to be created, so register the example file CLI
		commands (which are very basic). */
		vRegisterFileSystemCLICommands();

		/* The priority of this task can be raised now the disk has been
		initialised. */
		vTaskPrioritySet( NULL, mainTCP_SERVER_TASK_PRIORITY );

		/* Wait until the network is up before creating the servers.  The
		notification is given from the network event hook. */
		ulTaskNotifyTake( pdTRUE, portMAX_DELAY );

		/* Create the servers defined by the xServerConfiguration array above. */
		pxTCPServer = FreeRTOS_CreateTCPServer( xServerConfiguration, sizeof( xServerConfiguration ) / sizeof( xServerConfiguration[ 0 ] ) );
		configASSERT( pxTCPServer );

		for( ;; )
		{
			/* The Xplained pro board does not define a pin for detecting the
			removal of the SD card, so periodically check for the cards
			presence. */
			prvSDCardDetect();

			/* Run the HTTP and/or FTP servers, as configured above. */
			FreeRTOS_TCPServerWork( pxTCPServer, xInitialBlockTime );
		}
	}

#endif /* ( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) ) */
/*-----------------------------------------------------------*/

#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )

	static void prvSDCardDetect( void )
	{
	static BaseType_t xWasPresent = pdTRUE, xIsPresent;
	FF_IOManager_t *pxIOManager;
	BaseType_t xResult;

		/* The Xplained Pro board does not define a pin for detecting the remove of
		the SD card, so check for the card periodically in software. */
		xIsPresent = FF_SDDiskDetect( pxDisk );
		if( xWasPresent != xIsPresent )
		{
			if( xIsPresent == pdFALSE )
			{
				FreeRTOS_printf( ( "SD-card now removed (%ld -> %ld)\n", xWasPresent, xIsPresent ) );

				/* _RB_ Preferably the IO manager would not be exposed to the
				application here, but instead FF_SDDiskUnmount() would, which takes
				the disk as its parameter rather than the IO manager, would itself
				invalidate any open files before unmounting the disk. */
				pxIOManager = sddisk_ioman( pxDisk );

				if( pxIOManager != NULL )
				{
					/* Invalidate all open file handles so they will get closed by
					the application. */
					FF_Invalidate( pxIOManager );
					FF_SDDiskUnmount( pxDisk );
				}
			}
			else
			{
				FreeRTOS_printf( ( "SD-card now present (%ld -> %ld)\n", xWasPresent, xIsPresent ) );
				configASSERT( pxDisk );

				xResult = FF_SDDiskMount( pxDisk );

				if( xResult > 0 )
				{
					FF_PRINTF( "FF_SDDiskMount: SD-card OK\n" );
					FF_SDDiskShowPartition( pxDisk );
				}
				else
				{
					FF_PRINTF( "FF_SDDiskMount: SD-card FAILED\n" );
				}
			}

			xWasPresent = xIsPresent;
		}
	}

#endif /*( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )*/
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{
const TickType_t xToggleRate = pdMS_TO_TICKS( 1000UL );
static TickType_t xLastToggle = 0, xTimeNow;

	xTimeNow = xTaskGetTickCount();

	/* As there is not Timer task, toggle the LED 'manually'.  Doing this from
	the Idle task will also provide visual feedback of the processor load. */
	if( ( xTimeNow - xLastToggle ) >= xToggleRate )
	{
		HAL_GPIO_TogglePin( GPIOB, GPIO_PIN_7 );
		xLastToggle += xToggleRate;
	}
}
/*-----------------------------------------------------------*/

void vAssertCalled( const char *pcFile, uint32_t ulLine )
{
volatile uint32_t ulBlockVariable = 0UL;
volatile const char *pcAssertedFileName;
volatile int iAssertedErrno;
volatile uint32_t ulAssertedLine;
volatile FF_Error_t xAssertedFF_Error;

	ulAssertedLine = ulLine;
	iAssertedErrno = stdioGET_ERRNO();
	xAssertedFF_Error = stdioGET_FF_ERROR( );
	pcAssertedFileName = strrchr( pcFile, '/' );

	/* These variables are set so they can be viewed in the debugger, but are
	not used in the code - the following lines just remove the compiler warning
	about this. */
	( void ) ulAssertedLine;
	( void ) iAssertedErrno;
	( void ) xAssertedFF_Error;

	if( pcAssertedFileName == 0 )
	{
		pcAssertedFileName = strrchr( pcFile, '\\' );
	}
	if( pcAssertedFileName != NULL )
	{
		pcAssertedFileName++;
	}
	else
	{
		pcAssertedFileName = pcFile;
	}
	FreeRTOS_printf( ( "vAssertCalled( %s, %ld\n", pcFile, ulLine ) );

